In [6]:
#check version
import sqlalchemy as db
db.__version__

'1.3.19'

In [10]:
#import some library
import sqlalchemy as db
from sqlalchemy.ext.declarative import declarative_base 
from sqlalchemy.orm import sessionmaker,mapper # for orm concept
import pandas as pd

In [3]:
#connect to the database
url = 'sqlite:///samples.db'
engine = db.create_engine(url)

In [5]:
#exceution assignment
conn = engine.connect()
meta = db.MetaData()

In [19]:
#classical mapping
user1 = db.Table('userone',meta,
                db.Column('id',db.Integer,primary_key = True),
                db.Column('name',db.String),
                db.Column('MobileNo',db.String),
                 
                )

class User1():
    def __init__(self,name,MobileNo):
        self.name = name
        self.MobileNo = MobileNo
mapper(User1,user1)    #class,table
meta.create_all(engine)

In [33]:
query = "select * from userone"
pd.read_sql_query(query,conn)

Empty DataFrame
Columns: [id, name, MobileNo]
Index: []

In [21]:
#declartive mapping
base = declarative_base()
class User2(base):
    __tablename__ =  'usertwo'
    id = db.Column(db.Integer, db.Sequence('user_id_seq'),primary_key=True)
    name = db.Column(db.String)
    fullname = db.Column(db.String)
    nickname = db.Column(db.String)
    
    def __repr__(self):
        return "<User(name='%s', fullname = '%s', nickname = '%s')>" %(self.name,self.fullname, self.nickname)

In [23]:
User2.__table__

Table('usertwo', MetaData(bind=None), Column('id', Integer(), table=<usertwo>, primary_key=True, nullable=False, default=Sequence('user_id_seq', metadata=MetaData(bind=None))), Column('name', String(), table=<usertwo>), Column('fullname', String(), table=<usertwo>), Column('nickname', String(), table=<usertwo>), schema=None)

In [25]:
base.metadata.create_all(engine)       #create table

In [26]:
query = "select * from usertwo"
pd.read_sql_query(query,conn)

Empty DataFrame
Columns: [id, name, fullname, nickname]
Index: []

In [27]:
#create session
Session = sessionmaker(bind=engine)
session = Session()

In [35]:
#add data in local variable 
use1 = User1('prasana','466789123')
session.add(use1)
use2 = User2(name = 'prasana', fullname = 'raj',nickname = 'kumar')
session.add(use2)

In [37]:
session.new   #can view data by using declartive base

IdentitySet([<__main__.User1 object at 0x7f1efabb8b50>, <__main__.User1 object at 0x7f1efaab5250>, <User(name='prasana', fullname = 'raj', nickname = 'kumar')>])

In [38]:
session.commit()#insert into database

In [47]:
query = "select u1.id as id1 ,u1.name,u2.id as id2 ,u2.name ,fullname, nickname from usertwo u2 join userone u1 "
pd.read_sql_query(query,conn)

   id1     name  id2     name fullname nickname
0    1  prasana    1  prasana      raj    kumar
1    2  prasana    1  prasana      raj    kumar